/// здесь описываются всякие базовые структуры от которых пойдёт дальше
/// дерево наследований. На каждый базовый класс есть своя папка
/// с таким же названием + _impl, где содержатся его наследники
/// Если у такого базового класса есть другой абстрактный наследник, то
/// в той же папки мы создаём аналогичную структуру :
/// - его extender
/// - папку с наследниками от этого extender
/// и там внутри папки может быть снова extender от предыдущего extender со
/// своей папкой и так далее рекурсивно
/// Ну и эти базовые классы можно упаковывать в группы по сфере логики, которую
/// они охватывают, как например для repositories_base